// import './index.css';

import { useEffect } from 'react';
import { useTranslation } from 'react-i18next';
import { HelperI18Next } from 'universal-helper';

import { getMethodStoreGlobal } from '../../global/store';
import initI18N from './i18n';

const sI18nDomainName = 'ghoststory3';
const I18N: HelperI18Next.TypeI18NDomain = initI18N({ name: sI18nDomainName });

const JSX = () => {
  const { setMenu, setI18NDomainName, setMenuUIIsShow } = getMethodStoreGlobal();
  const { t } = useTranslation([sI18nDomainName]);

  useEffect(() => {
    setI18NDomainName(sI18nDomainName);
    setMenuUIIsShow(true, false, true);
    setMenu(t('header'), 5);
  }, []);
  return (
    <>
      <div className="flex-1 overflow-y-auto scroll-smooth">
        วิถีชีวิตของชาวเขาเผ่าต่างๆที่อาศัยอยู่บนดอยสูงนั้น
        วัฒนธรรมพวกเขาเคยสงบหยุดนิ่งมาหลายชั่วอายุคน
        ปัจจุบันเริ่มเปลี่ยนแปลงไปตามกระแสโลกยุคใหม่มากขึ้น วัยรุ่นแต่งตัวเกาหลี
        วัฒนธรรมจากภายนอกหลั่งไหลเข้าไปและรับเอาโดยคนรุ่นใหม่อย่างไม่ยากเย็น
        วิถีเก่าๆจึงค่อยๆจืดจางลงไปตามกาลเวลา แต่มีบางสิ่งยังคงอยู่
        แม้กาลเวลาจะผ่านไปนานเท่าใดก็ตาม ในอดีต เรือกสวนไร่นาของชาวเขา
        ส่วนใหญ่จะอยู่ห่างจากหมู่บ้าน ลัดเลาะไปตามไหล่เขาไกลบ้างใกล้บ้าง
        เนื่องจากพื้นที่ปลูกพืชที่ดีๆหายาก
        แต่ละครอบครัวจึงต้องเดินเข้าป่าลึกเพื่อถากถากจับจองกันเองตามกำลัง
        เมื่อพืชผลเจริญงอกงาม ด้วยระยะทางจากบ้านมาก็ไกลโข
        จึงเกิดความระแวงว่าแขกไม่ได้รับเชิญจะมาเก็บเอาผลผลิตไปโดยวิสาสะ
        จึงต้องมีพิธีกรรมบางอย่างเกิดขึ้น....
        เริ่มจากตระเตรียมสำรับกับข้าวของคาวของหวานและเหล้าสำหรับเซ่นไหว้จนครบแล้ว
        จึงเริ่มการสวดด้วยคาถาอาคมที่สืบทอดกันมาหลายรุ่น
        คาถานั้นเป็นคำสาปแช่งให้ผู้ที่เอาของจากไร่โดยไม่ได้รับอนุญาตนั้นให้มีอันเป็นไป
        หลังจากนั้นหัวหน้าครอบครัวก็จะสั่งคนในบ้านว่า
        ห้ามกินของในไร่เป็นอันขาดจนกว่าจะถึงฤดูเก็บเกี่ยว แต่แล้วก็เกิดเรื่องขึ้นจนได้
        ครอบครัวนี้มีลูกหลายคน และหลายวัย เด็กชายตัวเล็กๆ ติดตามพ่อแม่ไปทำงานในไร่
        ทั้งพ่อทั้งแม่มัวแต่ยุ่งกับงานในไร่ จึงไม่ได้สนใจลูก ฝ่ายลูกชายที่มัวเล่นเพลิน
        ด้วยความหิว จึงคว้าเอาพุทราผลหนึ่งเข้าปาก และตามด้วยอีกผลด้วยความเอร็ดอร่อย
        กระทั่งเย็นย่ำ สามพ่อแม่ลูกจึงเดินทางกลับเข้าหมู่บ้าน
        ภรรยาหุงหาอาหารเสร็จสรรพเรียบร้อย จึงเรียกทุกคนล้อมวงกินข้าวกัน
        หลังจากกินได้ไม่นาน ลูกชายคนเล็กก็ล้มลง ตัวโก่งตัวงอ ปากร้องว่า "ปวดท้องๆ"
        แม่ตกใจลนลาน รีบไปหายาสมุนไพรแก้ปวดท้องมาให้กิน อาการก็ยังไม่ทุเลา
        คนเป็นพ่อเริ่มเอะใจว่าไม่น่าจะปวดท้องแบบธรรมดาซะแล้ว
        ในใจนึกว่าขออย่าให้เป็นดังที่คิดเลย ทนไม่ไหวเต็มทีจึงถามลูกว่า "ตอนกลางวัน
        นอกจากข้าวที่เตรียมมา แกไปกินอะไรอีก" ลูกชายฝืนใจตอบอย่างยากเย็น "พุทรา"
        คนเป็นพ่อตกใจ "พุทราที่ไหน" "ในไร่เรา" "ฮ้า!!!....." พ่อใจหล่นวูบ
        เป็นดังที่คิดเสียแล้ว กระวีกระวาดเตรียมของจำเป็นสำหรับไหว้แล้ว
        คว้าไฟฉายแล้ววิ่งไปไร่ทันที หนทางไปไร่มืดสนิทมีแต่แสงไฟฉายนำทางวูบๆวาบๆ
        เหนื่อยแทบขาดใจจึงถึงไร่ วางเครื่องเซ่นลงจัดแจง ใจยังเต้นตุ้บๆ
        ปากแทบจะท่องคาถาไม่เป็นคำ หลังจากว่าคาถาคลายคำสาปแช่งเสร็จ
        เชื่อว่ามนต์นั้นถูกคลายแล้วอย่างแน่นอน
        เก็บข้าวเก็บของเสร็จวิ่งอย่างไม่คิดชีวิตกลับมาบ้าน กระหืดกระหอบขึ้นบันได
        ถามเมียว่าลูกเป็นอย่างไร เมียหันหลังให้ เห็นแต่หัวกับเท้าลูกพาดบนตัก
        "ลูกเราเสียแล้วพี่ ฮือ..ฮือ..." คนเป็นพ่อน้ำตาคลอเบ้า แข้งขาอ่อนทรุดลงทันที
        เราช้าไปเสียแล้ว ใจคิดแต่โทษตัวเองว่าช่วยลูกชายไว้ไม่ได้ จึงปล่อยโฮตามเมียอีกคน
        ร่างลูกถูกคลุมด้วยผ้าขาว บนหัวนอนมีโคมน้ำมันก๊าดจุดไว้ทั้งคืน
        รุ่งเช้าญาติพี่น้องช่วยกันจัดพิธีฝังศพตามมีตามเกิดด้วยบรรยากาศที่แสนจะโศกเศร้า
        ครอบครัวหนึ่ง ต้องสูญเสียลูกชายด้วยความคับแค้นใจ พืชผลในไร่กับชีวิตของลูกชาย
        หากแลกได้คงไม่เอาอันใดนอกจากชีวิตของลูก
        เรื่องนี้เป็นอุทาหรณ์สำหรับชาวเขาด้วยกันเอง
        การใช้มนต์ดำเพื่อรักษาพืชผลจึงต้องทำอย่างระมัดระวัง แต่สำหรับพ่อที่เสียลูกไป
        คงไม่อยากใช้อีกเลยตลอดชีวิต หนาวนี้หลายคนชอบไปเที่ยวดอยสูง หากเจอดอกไม้สวยๆ
        ผลไม้งามๆ ที่ไหนสักแห่งบนเขา แล้วคิดจะเด็ดมาชิมหรือชมแล้วละก็ ไม่แน่ว่า
        อาจมีคำสาปพ่อเฒ่าชาวเผ่าผู้หวงแหนแฝงอยู่ก็เป็นได้
      </div>
    </>
  );
};

export default { I18N, JSX };
