// import './index.css';

import { useEffect } from 'react';
import { useTranslation } from 'react-i18next';
import { HelperI18Next } from 'universal-helper';

import { getMethodStoreGlobal } from '../../global/store';
import initI18N from './i18n';

const sI18nDomainName = 'ghoststory2';
const I18N: HelperI18Next.TypeI18NDomain = initI18N({ name: sI18nDomainName });

const JSX = () => {
  const { setMenu, setI18NDomainName, setMenuUIIsShow } = getMethodStoreGlobal();
  const { t } = useTranslation([sI18nDomainName]);

  useEffect(() => {
    setI18NDomainName(sI18nDomainName);
    setMenuUIIsShow(true, false, true);
    setMenu(t('header'), 5);
  }, []);
  return (
    <>
      <div className="flex-1 overflow-y-auto scroll-smooth">
        เราเป็นคนภาคอิสาน เรียนจบจากมหาวิทยาลัยแห่งหนึ่งทางภาคอิสาน
        พอเรียนจบเราได้มีโอกาสมาทำงานที่ โรงเรียนเอกชนแห่งหนึ่งที่จังหวัดสมุทรปราการ
        โรงเรียนมีหอพักครูอยู่ในหมู่บ้านแห่งหนึ่งที่อยู่หลังโรงเรียน หมู่บ้าน
        นี้ใหญ่มากมีซอยเยอะมาก ซึ่งหอพักครูจะอยู่ระหว่างซอยที่ 17-19 หอพักมีสองชั้น
        เราได้ห้องข้างล่างห้องที่สอง หลังห้องเราเป็นบ้านร้างไม่มีคนอยู่อาศัย
        ต้นไม้ขึ้นรกมาก หญ้าวัชพืชขึ้นปกคลุมบริเวณบ้าน และที่สำคัญร้านขายของชำอยู่ไกลมาก
        ถ้าจำไม่ผิดน่าจะอยู่ซอย 3 เวลาไปชื้อของก็ยืมจักรยานพี่ที่หอ เรา
        ชอบปั่นจักรยานออกมาชื้อของเวลา 20.00-21.00 เป็นประจำ
        วันแรกที่เราปั่นจักรยานเพื่อที่จะไปชื้อของเราปั่นไปซอยที่ 19
        ปั่นไปไม่ถึงครึ่งซอยก็มีสุนัขไล่กัดอย่างเอาเป็นเอาตาย และก็เห่า มันน่ากลัวมาก
        วันต่อมาเราก็ปั่นจักรยานไปชื้อของอีกแต่ทีนี้เราเปลี่ยนซอย เป็ซอยที่ 18
        ปรากฏว่าไม่ต่างจากซอยที่ 19 เลย วันต่อมาเราก็ปั่นจักรยานไปชื้อของอีกเราปั่นซอยที่
        17 ในขณะที่ปั่นไปก็คิดว่าจะเป็นเหมือนกับ 2 ซอยที่ผ่านมาไหม
        ปรากฏว่าทุกอย่างเงียบกริบ ไม่มีสุนัขออกมาไล่กัดสักตัว
        เห่าก็ไม่มีบรรยากาศสองข้างทางเป็นเท้าว์เฮ้าท์สองชั้น มัดูรกร้างต้นไม้ขึ้น
        ใบไม้หล่นในบริเวณเท้าว์เฮ้าท์ มีคนอาศัยอยู่แค่ไม่กี่หลัง ทำให้ดูวังเวงมาก
        แต่เราก็ไม่ได้คิดอะไรเพราะว่าเรารู้แล้วว่าซอยนี้ปลอดภัย
        หลังจากนั้นมาเราก็ปั่นจักรยานผ่านที่ซอยนี้ประจำ เข้าเรื่องเลยนะ ค่ะ
        วันหนึ่งขณะที่เรากำลังนั่งเล่นเกมส์อย่างเมามันส์ เสียง msn ดังขึ้นเพื่อนเราทักมา
        บอกว่าให้เปิดกล้องคุยกัน เราก็เลยหยุดเล่นเกมส์แล้วเปิดกล้องคุยกับเพื่อน
        ตอนนั้นน่าจะเย็นมากล่ะ เราเปิดไฟในห้องไว้ ไฟตรงอื่นยังไม่ได้เปิด
        ฝั่งเพื่อนมีกันอยู่ 5-7 คน เพื่อนถามว่าอยู่กับใคร เราบอกว่าคนเดียว
        พร้อมกับหมุนกล้องให้เพื่อนดู คุยกันได้สักพักเราเลยบอกเพื่อนว่าจะไปเข้าห้องน้ำ
        พูดเสร็จเราก็ลุกไปเข้าห้องน้ำพอกลับมาปรากฏว่าเพื่อนปิดกล้องไป แล้ว
        เราเลยถามว่าปิดทำไม เพื่อนเลยถามว่าอยู่กับใคร เราบอกว่าอยู่คนเดียว
        เพื่อนก็ถามย้ำอีกว่าอยู่กับใคร เราก็นืนยันว่าอยู่คนเดียวจริงๆ
        และเพื่อนก็บอกว่าตอนที่เราไปเข้าห้องน้ำ
        กล้องค้างตรงหน้าห้องน้ำแล้วเหงเรากำลังจะไปเข้าห้องน้ำเห็นผู้หญิงคนหนึ่ง
        ผมยาวใส่เสื้อสีขาวและกางเกงสีเทา เราไม่เชื่อที่เพื่อนพูด เพื่อนส่งรูปมาเป็นหลักฐาน
        ส่งเราก็อธิบายไม่ได้เหมือนกันว่ามันคืออะไร เรามีรูปให้เพื่อนๆได้พิจารณาด้วยนะค่ะ
        ขอย้ำนะค่ะไม่มีการตัดต่อใดๆทั้งสิน พอตื่นเช้ามาเราไปกินข้าวที่ร้านป้า ข้างๆหอ
        ด้วยความที่อยากรู้เลยถามเอารูปให้ป้าดู
        ป้าดูได้สักพักก็ส่งให้คนในร้านข้าวดูบ้างทุกคนต่างพูดเป็นเสียงเดียวกันว่า
        ผู้หญิงคนนี้ เธอเป็นคนภาคอิสานมาทำงานที่จังหวัดสมุทรปราการพร้อมกับแฟนของเธอ
        เธอทำงานก่อสร้างสักแห่งในจังหวัดนี้ เธอพักที่เท้าว์เฮ้าท์ซอย 17 อยู่กันหลายคน
        แฟนเธอเป็นคนเจ้าชู้ มีเมียน้อยและไม่ค่อยกลับมาหาเธอ เธอทำได้แค่รอและคอนนี้เธอท้อง
        วันหนึ่งแฟนเธอกลับมา เธอบอกเขาท้อง แต่แฟนของเธอบอกให้เธอไปทำแท้ง แต่เธอไม่ยอม
        แฟนของเธอเดินออกจากบ้านไปและไม่กลับมาอีกเลย มันทำให้เธอคิดสั้น
        วันต่อมาเพื่อนๆของเธอออกไปทำงานกันหมดเหลือเธอคนเดียว เธอบอกว่าไม่สบายอยากพัก
        เพื่อนๆก็ไม่แอ๊ะใจอะไร พอเพื่อนออกไปได้สักระยะ เธอก็ผูกคอตายในเท้าว์เฮ้าท์นั้น
        กว่าเพื่อนจะรู้ก็ตอนที่กลับจากทำงานแล้ว
        เพื่อนของเธอเลยนำศพเธอกลับไปยังย้านเกิดของเธอ หลังจากที่เธอตายไปได้ไม่นาน
        เธอเฮี้ยนมาก หลอกคนที่อยู่ในละแวกนั่นบ่อยมากจนคนในซอยเริ่มทยอยย้ายไปทีละหลัง
        จนเหลือแค่ไม่กี่หลัง ป้าบอกว่าเธอเพิ่งหยุดเฮี้ยนไป 3 เดือนก่อนน่าเราจะมาอยู่
        เราก็ไม่ได้คิดอะไร เราใช้ชีวิตเหมือนเดิม เหมือนไม่มีอะไรเกิดขึ้น
        หลังจากนั้นไม่นานวันนั้นเป็นวันหยุดยาว ครูที่หอกลับบ้านกันหมด เหลือแค่เราคนเดียว
        ขณะที่เราเล่นเกมส์อยู่น่าจะห้าโมงเย็น เราได้ยินเสียงคนทุบประตูห้องน้ำ ปัง ปัง ปัง
        เสียงดังมาก มันดังมาจากห้องเราเอง เราได้ยินเราก็สะดุง ตกใจมาก
        แต่ก็ทำเป็นไม่สนใจอะไร หลายวันผ่านไปขณะที่เรานอนอยู่ เราได้ยินเสียงคนเดินในห้อง
        เดินไปมา เราก็ทำเป็นไม่ได้ยินแล้วนอนต่อ และก่อนนอนคืนหนึ่งเราพูดออกไปว่า ถ้ามีจริง
        แน่จริงคืนนี้ยอกหวยด้วยเข้าฝันก็ได้ แล้วอยากได้อะไรก็จะให้
        พูดออกมาด้วยความโมโหไม่ทันได้คิดอะไร แล้วเราก็หลับไป ฝันว่าเห็น
        ตัวเองนอนอยู่บนเตียงแล้วได้ยินเสียงกร็อกแกร็ก ที่บ้านเกร็ดประตูหลังห้อง
        แล้วเราก็หันไปดู เห็นเป็นมือเหี่ยวๆ มีเล็บยาวมาก กำลังเอามือเข้ามาในบานเกร็ด
        ด้วยความที่ตกใจคิดว่าเป็นโจร เลยลุกจากที่นอนแล้วไปหยิบมีดมาฝันที่มือนั้น
        เราได้ยินเสียงกรี๊ดร้องสักพักก็หายไป
        แล้วได้ยินเสียงคนทุบประตูอยู่หน้าห้องแล้วเสียงก็เงียบ สักพักเห็นเป็นเงาดำๆ
        รูปร่างผู้หญิงผมยาวยืนอยู่ปลายเตียงแล้วพูดว่า อยากได้หวยไม่ใช่หรอ เราตอบว่าใช่
        ผู้หญิงคนนั้นเลยให้หวยมาสองตัว พอเราตื่นมาตอนเช้าโทรให้น้องชื้อให้ เราก็ชื้อนะ 5
        บาท เราไม่ชอบเล่นหวย พอวันหวยออกปรากฏว่าถูก เราโทรไปหาน้อง
        น้องบอกว่าลืมไม่ได้ชื้อให้ เราก็ไม่ได้อะไร หลังจากนั้นเราก็ลืมเรื่องนี้ไปเลย
        ช่วงนั้นเราไม่ อยากกลับบ้านขนาดมีวันหยุดยาวเรายังไม่กลับ
        พอไปทำงานพี่ที่โรงเรียนทักว่า ทำไมช่วงนี้ดูคล่ำๆ หน้าหมองจัง โดนของหรือป่าว
        เราก็บอกว่าไม่หรอกมั้ง ช่วงนั่นเราไม่สบายบ่อยมาก เป็นๆ หายๆ
        มีอยู่วันหนึ่งอยู่ๆเราอยากกลับบ้านขึ้นมาสะงั้น เราเดินไปหาพี่บอกว่าอยากกลับบ้าน
        พี่เลยบอกว่ากลับด้วยกันไหม พี่จะกลับพอดี พรุ่งนี้ไปพร้อมกัน
        เราก็ตอบตกลงเพราะมีเพื่อนกลับ พอ ไปถึงบ้านยายถามว่าทำไมผอมจัง น่าดูคล้ำมาก
        เดี๋ยวพรุ่งนี้พาไปวัด ตื่นเช้ามายายพาไปวัด
        วัดนี้เป็นวัดป่าและเป็นที่นับถือของคนในพื้นที่ พอเดินเข้าไปในศาลา
        พระพูดว่าโยมพาใครมาด้วย เราก็หันหลังกลับไปมองก็ไม่มีใคร พระบอกว่าโยมนั้นแหละ
        มีคนตามมาด้วย เราเลยลองเชิงพระรูปนั้นว่าที่ตามมาเป็นผู้ชายหรือผู้หญิง
        ท่านตอบว่าเป็นผู้หญิง เราถามว่าแล้วตามมาจากไหน ท่านตอบว่าตามมาจากที่ทำงาน
        เราถามว่าแล้วเขาต้องการอะไร ท่านตอบว่าแล้วโยมพูดอะไรกับเขาไว้ล่ะ
        เราก็นั่งคิดสักพักก็พูดขึ้นมาว่า อยากได้อะไรก็จะให้
        ท่านเลยบอกว่านั้นแหละที่เจาตามโยมมา เราถามว่า
        แล้วเขาต้องการอะไรท่านเลยบอกว่าเขาต้องการชีวิตของโยม ดีนะที่ดวงยังไม่ถึงคาด
        ป่วยบ่อยใช่ไหมเราตอบใช่ค่ะ ท่านบอกว่าไม่แปลกหรอกก็เขาไปไหนมาไหนกับโยมตลอด
        ยานถามพระว่าพอมีทางแก้ไหม ท่านเลยตอบว่ามี แต่ต้องทำภายในสามวันไม่งั้นตาย
        ไปรดน้ำมนต์ 7 วัดภายในวันเดียวต้องได้ 7 วัด และต้องทำภายใน 3
        วันนี้เท่านั้นแล้วเขาก็จะไม่มากวนอีก เรากับยายก็กลับบ้าน
        พอตื่นเช้ามาตากะยายพาไปรดน้ำมนต์ 7 วัดหลังจากนั้นมาเราก็ไม่เคยเจอเธออีกเลย
      </div>
    </>
  );
};

export default { I18N, JSX };
