// import './index.css';

import { useEffect } from 'react';
import { useTranslation } from 'react-i18next';
import { HelperI18Next } from 'universal-helper';

import { getMethodStoreGlobal } from '../../global/store';
import initI18N from './i18n';

const sI18nDomainName = 'ghoststory1';
const I18N: HelperI18Next.TypeI18NDomain = initI18N({ name: sI18nDomainName });

const JSX = () => {
  const { setMenu, setI18NDomainName, setMenuUIIsShow } = getMethodStoreGlobal();
  const { t } = useTranslation([sI18nDomainName]);

  useEffect(() => {
    setI18NDomainName(sI18nDomainName);
    setMenuUIIsShow(true, false, true);
    setMenu(t('header'), 5);
  }, []);
  return (
    <>
      <div className="flex-1 overflow-y-auto scroll-smooth">
        เรื่องทีจะเล่าต่อไปนี้ เป็นเรื่องของความเชื่อ เรื่องลี้ลับ
        โปรดใช้วิจารณญาณในการอ่าน ดิฉันอายุ 32 ปี
        ทำงานเป็นพนักงานขายเครื่องสำอางยี้ห้อหนึ่ง ดิฉันมีโอกาศได้ไปทำงานต่างจังหวัดบ่อย ๆ
        แต่ละจังหวัดที่ไปทำงานนั้น เราจะต้องพักเป็นเวลาหลายวัน ซึ้งที่พักแต่ละที่นั้น
        มีทั้งดีแหละไม่ดี แต่มีสถานที่หนึ่งนั้น ทำให้ดิฉันลืมมันไม่ลง เป็นสถานที่
        ที่ทำให้จำมันมาถึงทุกวันนี้
        ดิฉันกับกลุ่มของเราได้รับหมอบหมายให้ไปประชาสัมพันธ์สินค้า
        ที่จังหวัดหนึ่งในภาคอีสาน เป็นเวลา 3 วัน
        ดิฉันได้ให้น้องในกลุ่มหาสถานที่พักเหมือนเคย แต่รอบนี้ หาที่พักยากเป็นพิเศษ
        เพราะเป็นช่วงเทศกาล หาเท่าไรก็ไม่ได้สักที จนมาเจอที่หนึ่ง เป็นที่พัก
        ทีห่างจากตัวอำเภอเมืองพอสมควร ที่พักชั้นล่างเป็นปูน ข้างบนชั้น 2 เป็นไม้ ดูรวม ๆ
        แล้วโอเค เราจึงตัดสินใจพักกันที่นี้ ดิฉันไม่คิดเลยว่า การตัดสินใจครั้ง
        เป็นการตัดสินใจที่พลาดที่สุดในชีวิต .. ก่อนการเดินทางทุกครั้ง
        เราจะรวมกลุ่มกันไปทำบุญกัน เพื่อเป็นสิริมงคลในการเดินทาง
        เราเลือกไปทำบุญที่วัดหนึ่งย่านฝั่งธนบุรี ซึ้งเป็นวัดประจำที่เราทำบุญกันก่อนเดินทาง
        เราเตรียม สังขทาน ดอกไม้ สิ่งของอื่น ๆ ไปถวายพระ ก่อนจะกลับจากวัดนั้น
        พระท่านได้ทักว่า รอบนี้พวกเอ็งคงกลับมาไม่ครบทุกคนนะ แล้วแต่บุญวาสนา
        พวกเราหันหน้ามองกัน พี่คนในกลุ่มเลยถามพระว่า มีอะไรหรือป่าวหลวงพ่อ หลวงพ่อมองหน้า
        แต่ไม่ได้พูดอะไร หลวงพ่อได้หยิบขันพรมน้ํามนต์ มาพรมให้กลุ่มเรา แล้วก็พูดขึ้นว่า
        อาตมาเป็นพระ พูดอะไรมากไม่ได้หลอก แล้วแต่บุญ
        แล้วแต่กรรมของแต่ละคนในเวลานั้นพวกเราไม่ได้คิดอะไรเลย ยังแซ่วคนในกลุ่มว่า
        สงสัยพี่ในกลุ่มจะได้เมียเป็นคนอีสาน คงไม่กลับมาทำงานแล้วละ
        เราพูดคุยกันกันไปอย่างสนุกสนาน พอดิฉันกลับมาถึงบ้าน เตรียมเสื้อผ้า ของใช้ต่าง ๆ
        ลงกระเป๋า เพื่อการเดินทางวันพรุ่งนี้
        ในช่วงเวลาที่ดิฉันกำลังจะนอนรู้สึกกำลังครึ่งหลับครึ่งตื่นนั้นไม่รู้ว่าฝันหรือป่าว
        ดิฉันเห็นภาพของยายของดิฉัน มาบอกว่า อย่าไปเลย
        พร้อมกับดึงมือของดิฉันไม่ให้ขึ้นรถตู้ พอพูดจบนั้น ดิฉันก็สดุ้งตื่น
        รู้สึกเจ็บข้อมือ รู้สึกปวด ๆ ดิฉันงงว่ามันคือความฝันหรือคิดมากไปเอง
        เพราะปกติดิฉันไม่เชื่อเรื่องพวกนี้อยู่แล้ว ดิฉันพยามยามไม่คิดอะไร
        พอถึงตอนเช้าก่อนออกจากบ้านดิฉันเห็น รูปกลุ่มเราทีถ่ายด้วยกันหล่นพื้น กระจกแตก
        กระจาย แต่ด้วยรถตู้มารอรับที่หน้าบ้านแล้ว เลยตะโกนบอกแม่ เก็บให้ด้วย
        เพื่อนมารอรับแล้ว ดิฉันรีบเอาเครื่องใช้สัมภาระต่าง ๆ ขึ้นรถเดินทางทันที
        ขณะที่รถออก ดิฉันมองกลับไปที่บ้าน เห็นคุนยาย มา ยืน อยุ่หน้าบ้าน ดิฉันตกใจมาก
        รู้สึกหน้ามืด ตอนนั้นกังวลใจ รู้สึกไม่ค่อยดีกับการเดินทางครั้งนี้
        เหมือนมีล่างบอกเหตุอะไรสักอย่าง แต่ก็ไม่ได้สนใจ
        พยายามคิดจะรีบทำงานให้เสร็จแล้วรีบกลับบ้าน
        <br />
        <br />
        <br />
        <a href="https://pantip.com/topic/33717223">อ่านต่อ</a>
      </div>
    </>
  );
};

export default { I18N, JSX };
